htanya19/pic16f7876a/Lab_7/Lab_7.X/Lab_7.c
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled)
#pragma config PWRTE = OFF      // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOREN = OFF      // Brown-out Reset Enable bit (BOR disabled)
#pragma config LVP = OFF        // Low-Voltage (Single-Supply) In-Circuit Serial Programming Enable bit (RB3 is digital I/O, HV on MCLR must be used for programming)
#pragma config CPD = OFF        // Data EEPROM Memory Code Protection bit (Data EEPROM code protection off)
#pragma config WRT = OFF        // Flash Program Memory Write Enable bits (Write protection off; all program memory may be written to by EECON control)
#pragma config CP = OFF         // Flash Program Memory Code Protection bit (Code protection off)

#include <xc.h>

#define _XTAL_FREQ 20000000

void strob (void)
{
    RC7 = 0;
    __delay_us (50);
    RC7 = 1;
    __delay_us (50);
}
char x;
char* y;
int i;
void main (void)
{
    TRISB = 0b00000000;
    TRISC = 0b00000000;
    __delay_ms (20);
    RC5=0;
    RC7=1;
    __delay_us (100);
    
    PORTB=0b00110000;
    __delay_ms (5);
    strob ();
    
    PORTB=0b00110000; 
    __delay_ms (5);
    strob ();
    
    PORTB=0b00110000;
    __delay_ms (5);
    strob ();
    
    PORTB=0b00111000;
    __delay_us (100);
    strob ();

    PORTB=0b00001111;
    __delay_us (100);
    strob ();
    
    PORTB=0b00000000;
    __delay_us (100);
      strob ();
    
    PORTB=136;
    __delay_us (100);
    strob ();

    RC5=1; 
    PORTB=0b00111100;
    __delay_us (50);
    strob ();
    
    while (1)
    {
    }
}